app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("account_details", "account_email", "account_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_details", ""], ["account_email", ""], ["account_name", ""], ["created_at", "2014-05-07 19:14:57.392030"], ["updated_at", "2014-05-07 19:14:57.392030"]]
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save