app/controllers/journals_controller.rb

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @account = Account.find(params[:account_id])

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @account = Account.find(params[:account_id])

SELECT "accounts".* FROM "accounts"
---
  def new
    @journal = Journal.new
    @accounts = Account.all

SELECT "accounts".* FROM "accounts"
SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @accounts = Account.all
    @account = Account.find(params[:account_id])

INSERT INTO "journals" ("created_at", "journal_date", "journal_entry_description", "journal_entry_type", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-01 21:21:08.264004"], ["journal_date", "2014-05-01"], ["journal_entry_description", ""], ["journal_entry_type", "Jamaa"], ["updated_at", "2014-05-01 21:21:08.264004"]]
---
  def create
    @journal = Journal.new(journal_params)

    respond_to do |format|
      if @journal.save

UPDATE "journals" SET "journal_entry_description" = $1, "updated_at" = $2 WHERE "journals"."id" = 1  [["journal_entry_description", ""], ["updated_at", "2014-05-04 22:33:47.636703"]]
---
  def update
    respond_to do |format|
      if @journal.update(journal_params)

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "journals" WHERE "journals"."id" = ?  [["id", 9]]
---
  def destroy
    @account = Account.find(params[:account_id])
    @journal.destroy

SELECT  "journals".* FROM "journals"  WHERE "journals"."id" = ? LIMIT 1  [["id", 9]]
---
    def set_journal
      @journal = Journal.find(params[:id])